execute as @s[scores={Azr_Shop=8431611}] \
    unless score tempPlayerShopSuccess Azr_system matches 1 \
    if score @s Azr_emerald matches 1.. \
    unless function skyblock:azr/shop/purchase/nether/\
    break run scoreboard players set tempPlayerShopSuccess Azr_system 1
    # 面包 <- 1 绿宝石  8431611

    # 熟猪排 <- 1 腐肉  8431612
    # 西瓜 ×3 <- 1 虫骸  8431613
    # 金萝卜 <- 2 胡萝卜  8431614
    # 箭 ×3 <- 1 燧石  8431617
    # 爆裂菜根 <- 1 甜菜种子  8431618
    # 碳钢 <- 1 钝铁 5 木棍  8431615
    # 软金 <- 1 软金 5 木棍  8431616
    # 武器：锁链长剑 <- 20 绿宝石 1 碳钢  8431619  
    # （黑钢）碳钢  8431629  
    # 武器：锁链长斧 <- 20 绿宝石 1 碳钢  8431620  
    # （黑钢）碳钢  8431630  
    # 武器：弓（弦束） <- 10 硬骨 5 丝线  8431621  
    # 武器：刃弩（钢刺） <- 10 硬骨 3 尸爪  8431622  
    # 防具：坚盾（改造） <- 8 盾牌碎片  8431623  
    # （化型） <- 20 盾牌碎片  8431624  
    # 防具：耐炎皮甲 <- 8 皮革  8431625  
    # 防具：耐炎皮鞋 <- 8 皮革  8431626  
    # 防具：试造狱铁铠 <- 20 绿宝石 1 碳钢  8431627  
    # 防具：试造狱铁靴 <- 20 绿宝石 1 碳钢  8431628  
    # 机械弩·柒壹式 <- 5 硬骨 5 丝线 5 燧石  8431631"}
    # 弹药×16 <- 1 炽焰粉尘  8431632  
